
#Область РегистрацияВнешнейОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "Вид"); //Строка, вид обработки, один из возможных: «ДополнительнаяОбработка», «ДополнительныйОтчет», «ЗаполнениеОбъекта», «Отчет», «ПечатнаяФорма» или «СозданиеСвязанныхОбъектов»
	
	// Массив строк имен объектов метаданных в формате: <ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>].
	// Например, «Документ.СчетЗаказ» или «Справочник.*». Примечание: параметр имеет смысл только для назначаемых обработок, для глобальных – не используется.
	
	//МассивНазначений = Новый Массив;
	//МассивНазначений.Добавить("Документ.<ИмяДокумента1>");
	//МассивНазначений.Добавить("Документ.<ИмяДокумента2>");
	
	//ПараметрыРегистрации.Вставить("Назначение", МассивНазначений); 
	
	ПараметрыРегистрации.Вставить("Наименование", "Наименование (ap-lab.ru)"); // Наименование обработки, которым будет заполнено наименование элемента справочника, краткое описание для идентификации обработки администратором.
	ПараметрыРегистрации.Вставить("Версия", "1.0"); // Версия обработки в формате <старший номер>.<младший номер> используется при загрузке обработок в информационную базу. Например: 1.0.
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина); // Принимает значение Истина или Ложь, в зависимости от того, требуется ли устанавливать или отключать безопасный режим при исполнении обработки (отчета). Если Истина, обработка (отчет) будет запущена в безопасном режиме При этом в частности, не гарантируется корректная работа дополнительных обработок под пользователями без полных прав в тех случаях, когда обработка вызывает код конфигурации, который не рассчитан на работу в безопасном режиме (в том числе, неявно, когда срабатывает код модуля объекта и подписок на события при записи данных)
	ПараметрыРегистрации.Вставить("Информация", "Разработчик: Проекты автоматизации бизнеса, cайт: www.ap-lab.ru"); // Краткая информация по обработке, описание обработки.
	ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4"); // Минимальная версия БСП, на которую рассчитывает код дополнительной обработки. Должна быть задана не младше 1.2.1.4. Номер версии БСП задается в формате «РР.ПП.ВВ.СС» (РР – старший номер редакции; ПП – младший номер редакции; ВВ – номер версии; СС – номер сборки)
	
	// Массив разрешений, предоставляемых дополнительной обработке при использовании программного интерфейса, расширяющего доступные разработчику дополнительной обработки операции, при выполнении дополнительной обработки в безопасном режиме
	// Для формирования массива необходимо использовать специальные функции общего модуля ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс. Эти функции названы по шаблону Разрешение* и преполагают передачу в качестве параметров ограничений, достаточных для работы дополнительной обработки
	
	//МассивРазрешений = Новый Массив;
	//МассивРазрешений.Добавить(ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.РазрешениеПроведениеДокументов());
	//МассивРазрешений.Добавить(ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.РазрешениеСозданиеCOMОбъекта());
	//
	//ПараметрыРегистрации.Вставить("Разрешения", МассивРазрешений);
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд,
	"Представление", 	// Представление – представление команды в пользовательском интерфейсе
	"Идентификатор", 	// Идентификатор – идентификатор команды; любая строка, уникальная в пределах данной обработки (отчета)
	"Использование", 	// Использование – вариант запуска команды: ОткрытиеФормы – открыть форму обработки; ВызовКлиентскогоМетода – вызвать клиентскую экспортную процедуру из модуля формы обработки; ВызовСерверногоМетода – вызвать серверную экспортную процедуру из модуля объекта обработки. СценарийВБезопасномРежиме – вызвать  серверную экспортную функцию из модуля объекта для формирования сценария выполнения   
	Ложь,				// ПоказыватьОповещение – Истина, если требуется показать оповещение при начале и при завершении работы обработки. Например, при запуске обработки без открытия формы 
	"ПечатьMXL");		// Модификатор – дополнительный модификатор команды. Используется для дополнительных обработок печатных форм на основе табличных макетов, для таких команд должен содержать строку ПечатьMXL 
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

#КонецОбласти



#Область ПечатнаяФормаВызовСерверногоМетода

//Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
//	
//	// Устанавливаем признак доступности печати покомплектно.
//	//ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
//	
//	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "<ИмяМакета>");
//	Если НужноПечататьМакет Тогда
//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
//		КоллекцияПечатныхФорм,
//		"<ИмяМакета>", // имя макета
//		НСтр("ru = '<Синоним макета>'"), // синоним макета
//		СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати), // исполняющая функция (в этом же модуле), возвращающая ТабличныйДокумент
//		, // картинка
//		"<ПолныйПутьКМакету>"); // путь к макету в дереве метаданных, например: "Документ._ДемоСчетНаОплатуПокупателю.ПФ_MXL_СчетЗаказ"
//	КонецЕсли;  
//	
//КонецПроцедуры

//Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати)
//	
//	// Создаем табличный документ и устанавливаем имя параметров печати.
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_СчетЗаказ";
//	// Получаем запросом необходимые данные.
//	Запрос = Новый Запрос();
//	Запрос.Текст =
//	"";
//	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	Шапка = Запрос.Выполнить().Выбрать();
//	ПервыйДокумент = Истина;
//	Пока Шапка.Следующий() Цикл
//		Если Не ПервыйДокумент Тогда
//			// Все документы нужно выводить на разных страницах.
//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		ПервыйДокумент = Ложь;
//		// Запомним номер строки, с которой начали выводить текущий документ.
//		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//		
//		// В табличном документе необходимо задать имя области, в которую был 
//		// выведен объект. Нужно для возможности печати покомплектно 
//		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
//		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
//	КонецЦикла;
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции	

#КонецОбласти

#Область ДополнительнаяОбработкаВызовСерверногоМетода

//Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
//	
//	// Реализация логики команды
//	Если ИдентификаторКоманды = "ИдентификаторКоманды" Тогда
//	ИначеЕсли
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеОбъектаВызовСерверногоМетода

//Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения,  ПараметрыВыполненияКоманды) Экспорт
//	
//	// Реализация логики команды
//	Если ИдентификаторКоманды = "ИдентификаторКоманды" Тогда
//	ИначеЕсли
//	КонецЕсли;
//	  
//КонецПроцедуры

#КонецОбласти

#Область СозданиеСвязанныхОбъектовВызовСерверногоМетода

//Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения, СозданныеОбъекты, ПараметрыВыполненияКоманды) Экспорт
//	
//	// Реализация логики команды
//	Если ИдентификаторКоманды = "ИдентификаторКоманды" Тогда
//	ИначеЕсли
//	КонецЕсли;
//	  
//КонецПроцедуры

#КонецОбласти
