
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительно"
// Дополнительно (сервер, вызов сервера, повторное использование возвращаемых значений - на время сеанса) 
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПолучитьДополнительнуюКонстанту(ИмяКонстанты) Экспорт

	Возврат Константы[ИмяКонстанты].Получить();	//Тест2

КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти